# RibbonButton Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonButton Properties
RibbonButton Class See Also
---
The RibbonButton type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Enabled | Gets or sets a value indicating whether the item is enabled.  (Inherited from RibbonItem.) |
| Image | The image of the button. |
| IsEnabledByContext | Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context. |
| ItemText | Gets or sets the text displayed on the item.  (Inherited from RibbonItem.) |
| ItemType | Gets the item type. (Inherited from RibbonItem.) |
| LargeImage | The large image shown on the button. |
| LongDescription | Long description of the command tooltip  (Inherited from RibbonItem.) |
| Name | The name of the item. (Inherited from RibbonItem.) |
| ToolTip | The description that appears as a ToolTip for the item. (Inherited from RibbonItem.) |
| ToolTipImage | The image to show as a part of the button extended tooltip  (Inherited from RibbonItem.) |
| Visible | Gets or sets a value indicating whether the item is visible.  (Inherited from RibbonItem.) |

# See Also
RibbonButton Class
Autodesk.Revit.UI Namespace